xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxPsi5_reg.h
/** \brief 10C, Start of Frame Time Stamp Capture Register 1 */
#define PSI5_CH1_SFTSC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SFTSC*)0xF000510Cu)
/** Alias (User Manual Name) for PSI5_CH1_SFTSC.
* To use register names with standard convension, please use PSI5_CH1_SFTSC.
*/
#define PSI5_SFTSC1 (PSI5_CH1_SFTSC)

/** \brief 110, Receive Data Register Low 1 */
#define PSI5_CH1_RDRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RDRL*)0xF0005110u)
/** Alias (User Manual Name) for PSI5_CH1_RDRL.
* To use register names with standard convension, please use PSI5_CH1_RDRL.
*/
#define PSI5_RDRL1 (PSI5_CH1_RDRL)

/** \brief 114, Receive Data Register High 1 */
#define PSI5_CH1_RDRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RDRH*)0xF0005114u)
/** Alias (User Manual Name) for PSI5_CH1_RDRH.
* To use register names with standard convension, please use PSI5_CH1_RDRH.
*/
#define PSI5_RDRH1 (PSI5_CH1_RDRH)

/** \brief 118, Pulse Generation Control Register 1 */
#define PSI5_CH1_PGC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_PGC*)0xF0005118u)
/** Alias (User Manual Name) for PSI5_CH1_PGC.
* To use register names with standard convension, please use PSI5_CH1_PGC.
*/
#define PSI5_PGC1 (PSI5_CH1_PGC)

/** \brief 11C, Channel Trigger Value Register 1 */
#define PSI5_CH1_CTV /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_CTV*)0xF000511Cu)
/** Alias (User Manual Name) for PSI5_CH1_CTV.
* To use register names with standard convension, please use PSI5_CH1_CTV.
*/
#define PSI5_CTV1 (PSI5_CH1_CTV)

/** \brief 120, Send Control Register 1 */
#define PSI5_CH1_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SCR*)0xF0005120u)
/** Alias (User Manual Name) for PSI5_CH1_SCR.
* To use register names with standard convension, please use PSI5_CH1_SCR.
*/
#define PSI5_SCR1 (PSI5_CH1_SCR)

/** \brief 124, Send Data Register Low 1 */
#define PSI5_CH1_SDRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDRL*)0xF0005124u)
/** Alias (User Manual Name) for PSI5_CH1_SDRL.
* To use register names with standard convension, please use PSI5_CH1_SDRL.
*/
#define PSI5_SDRL1 (PSI5_CH1_SDRL)

/** \brief 128, Send Data Register High 1 */
#define PSI5_CH1_SDRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDRH*)0xF0005128u)
/** Alias (User Manual Name) for PSI5_CH1_SDRH.
* To use register names with standard convension, please use PSI5_CH1_SDRH.
*/
#define PSI5_SDRH1 (PSI5_CH1_SDRH)

/** \brief 12C, Send Shift Register Low 1 */
#define PSI5_CH1_SSRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SSRL*)0xF000512Cu)
/** Alias (User Manual Name) for PSI5_CH1_SSRL.
* To use register names with standard convension, please use PSI5_CH1_SSRL.
*/
#define PSI5_SSRL1 (PSI5_CH1_SSRL)

/** \brief 130, Send Shift Register High 1 */
#define PSI5_CH1_SSRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SSRH*)0xF0005130u)
/** Alias (User Manual Name) for PSI5_CH1_SSRH.
* To use register names with standard convension, please use PSI5_CH1_SSRH.
*/
#define PSI5_SSRH1 (PSI5_CH1_SSRH)

/** \brief 134, Send Output Register Low 1 */
#define PSI5_CH1_SORL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SORL*)0xF0005134u)
/** Alias (User Manual Name) for PSI5_CH1_SORL.
* To use register names with standard convension, please use PSI5_CH1_SORL.
*/
#define PSI5_SORL1 (PSI5_CH1_SORL)

/** \brief 138, Send Output Register High 1 */
#define PSI5_CH1_SORH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SORH*)0xF0005138u)
/** Alias (User Manual Name) for PSI5_CH1_SORH.
* To use register names with standard convension, please use PSI5_CH1_SORH.
*/
#define PSI5_SORH1 (PSI5_CH1_SORH)

/** \brief 2F8, Interrupt Overview Register */
#define PSI5_INTOV /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTOV*)0xF00052F8u)

/** \brief 2FC, Interrupt Node Pointer Register 0 */
#define PSI5_INP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INP*)0xF00052FCu)

/** \brief 300, Interrupt Node Pointer Register 1 */
#define PSI5_INP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INP*)0xF0005300u)

/** \brief 310, Interrupt Status Register A 0 */
#define PSI5_INTSTATA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005310u)

/** \brief 314, Interrupt Status Register A 1 */
#define PSI5_INTSTATA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005314u)

/** \brief 324, Interrupt Status Register B 0 */
#define PSI5_INTSTATB0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005324u)

/** \brief 328, Interrupt Status Register B 1 */
#define PSI5_INTSTATB1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005328u)

/** \brief 338, Interrupt Set Register A 0 */
#define PSI5_INTSETA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF0005338u)

/** \brief 33C, Interrupt Set Register A 1 */
#define PSI5_INTSETA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF000533Cu)

/** \brief 34C, Interrupt Set Register B 0 */
#define PSI5_INTSETB0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF000534Cu)

/** \brief 350, Interrupt Set Register B 1 */
#define PSI5_INTSETB1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF0005350u)

/** \brief 360, Interrupt Clear Register A 0 */
#define PSI5_INTCLRA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005360u)

/** \brief 364, Interrupt Clear Register A 1 */
#define PSI5_INTCLRA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005364u)

/** \brief 374, Interrupt Clear Register A 0 */
#define PSI5_INTCLRB0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005374u)

/** \brief 378, Interrupt Clear Register A 1 */
#define PSI5_INTCLRB1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005378u)

/** \brief 388, Interrupt Enable Register A 0 */
#define PSI5_INTENA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENA*)0xF0005388u)

/** \brief 38C, Interrupt Enable Register A 1 */
#define PSI5_INTENA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENA*)0xF000538Cu)

/** \brief 39C, Interrupt Enable Register B 0 */
#define PSI5_INTENB0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENB*)0xF000539Cu)

/** \brief 3A0, Interrupt Enable Register B 1 */
#define PSI5_INTENB1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENB*)0xF00053A0u)

/** \brief 3CC, OCDS Control and Status */
#define PSI5_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_OCS*)0xF00053CCu)

/** \brief 3D0, Access Enable Register 0 */
#define PSI5_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_ACCEN0*)0xF00053D0u)

/** \brief 3D4, Access Enable Register 1 */
#define PSI5_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_ACCEN1*)0xF00053D4u)

